---
kind: method
id: M:Autodesk.Revit.UI.DockablePane.#ctor(Autodesk.Revit.UI.DockablePane)
source: html/e957aebc-c7ab-c784-c3ab-33c0e79d16ce.htm
---
# Autodesk.Revit.UI.DockablePane.#ctor Method

Constructs a new copy of the input DockablePane object.

## Syntax (C#)
```csharp
public DockablePane(
	DockablePane other
)
```

## Parameters
- **other** (`Autodesk.Revit.UI.DockablePane`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null